{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 30, 80, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            },
            "name": "input_layer",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "batch_input_shape": [null, 30, 80, 1],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d",
            "inbound_nodes": [[["input_layer", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
              "moving_variance_initializer": { "class_name": "Ones", "config": {} }
            },
            "name": "batch_normalization",
            "inbound_nodes": [[["conv2d", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "max_pooling2d",
            "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "activation": "relu"
            },
            "name": "conv2d_1",
            "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": { "name": "batch_normalization_1", "trainable": true },
            "name": "batch_normalization_1",
            "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": { "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2] },
            "name": "max_pooling2d_1",
            "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": { "name": "conv2d_2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "activation": "relu", "padding": "same" },
            "name": "conv2d_2",
            "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": { "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2] },
            "name": "max_pooling2d_2",
            "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]
          },
          {
            "class_name": "Flatten",
            "config": { "name": "flatten", "trainable": true },
            "name": "flatten",
            "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": { "name": "dense", "trainable": true, "units": 512, "activation": "relu" },
            "name": "dense",
            "inbound_nodes": [[["flatten", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout", "trainable": true, "rate": 0.4 },
            "name": "dropout",
            "inbound_nodes": [[["dense", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": { "name": "char_0", "units": 36, "activation": "softmax" },
            "name": "char_0",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": { "name": "char_1", "units": 36, "activation": "softmax" },
            "name": "char_1",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": { "name": "char_2", "units": 36, "activation": "softmax" },
            "name": "char_2",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": { "name": "char_3", "units": 36, "activation": "softmax" },
            "name": "char_3",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": { "name": "char_4", "units": 36, "activation": "softmax" },
            "name": "char_4",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_layer", 0, 0]],
        "output_layers": [
          ["char_0", 0, 0],
          ["char_1", 0, 0],
          ["char_2", 0, 0],
          ["char_3", 0, 0],
          ["char_4", 0, 0]
        ]
      }
    },
    "training_config": null
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of3.bin",
        "group1-shard2of3.bin",
        "group1-shard3of3.bin"
      ],
      "weights": [
        { "name": "batch_normalization/gamma", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization/beta", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization/moving_mean", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization/moving_variance", "shape": [32], "dtype": "float32" },
        { "name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32" },
        { "name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32" },
        { "name": "char_0/kernel", "shape": [512, 36], "dtype": "float32" },
        { "name": "char_0/bias", "shape": [36], "dtype": "float32" },
        { "name": "char_1/kernel", "shape": [512, 36], "dtype": "float32" },
        { "name": "char_1/bias", "shape": [36], "dtype": "float32" },
        { "name": "char_2/kernel", "shape": [512, 36], "dtype": "float32" },
        { "name": "char_2/bias", "shape": [36], "dtype": "float32" },
        { "name": "char_3/kernel", "shape": [512, 36], "dtype": "float32" },
        { "name": "char_3/bias", "shape": [36], "dtype": "float32" },
        { "name": "char_4/kernel", "shape": [512, 36], "dtype": "float32" },
        { "name": "char_4/bias", "shape": [36], "dtype": "float32" },
        { "name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [32], "dtype": "float32" },
        { "name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32" },
        { "name": "conv2d_2/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [3840, 512], "dtype": "float32" },
        { "name": "dense/bias", "shape": [512], "dtype": "float32" }
      ]
    }
  ]
}
